NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32MG24/EFR32MG24A020F1536IM40.svd
        <register>
          <name>DSLCTRL</name>
          <description>No Description</description>
          <addressOffset>0x0C4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7FFFFF7F</resetMask>
          <fields>
            <field>
              <name>DSLMODE</name>
              <description>Dynamic Frame Length Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Dynamic Frame Length support is disabled, and the frame length is controlled by writing directly to the FRAMELENGTH field</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLEBYTE</name>
                  <description>Dynamic Frame Length is enabled and located in a single byte over air. This byte is loaded into the least significant byte of the extracted length field</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLEBYTEMSB</name>
                  <description>Dynamic Frame Length is enabled and located in a single byte over air. This byte is loaded into the most significant byte of the extracted length field</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DUALBYTELSBFIRST</name>
                  <description>Dynamic Frame Length is enabled and located in two bytes over air, of which the least significant byte is transferred first</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DUALBYTEMSBFIRST</name>
                  <description>Dynamic Frame Length is enabled and located in two bytes over air, of which the most significant byte is transferred first</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INFINITE</name>
                  <description>Dynamic Frame Length support is disabled, and infinite frame lengths are transmitted and received. RXABORT may be used  to abort active receive operations, while the TXDIS command (available in the RAC) may be used to abort active transmit operations.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLOCKERROR</name>
                  <description>In transmit mode, the frame length must be written directly to the FRAMELENGTH field. In receive mode, data will be received  until a block decoding error is found.</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSLBITORDER</name>
              <description>Dynamic Frame Length Bit order</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Bit ordering is defined by the BITORDER field</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REVERSE</name>
                  <description>Bit ordering is reversed, compared to what is defined by the BITORDER field</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSLSHIFT</name>
              <description>Dynamic Frame Length bitshift</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSLOFFSET</name>
              <description>Length Field Offset Value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSLBITS</name>
              <description>Length field number of bits</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSLMINLENGTH</name>
              <description>Minimum decoded length</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXSUPRECEPMODE</name>
              <description>RX Supplement Reception Mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOSUP</name>
                  <description>Do not receive SUP</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOIDSLBASED</name>
                  <description>Receive SUP based on BOI and fetch SUPLEN from DSL setting</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOIFIXEDSLBASED</name>
                  <description>Receive SUP based on BOI and fetch SUPLEN from WCNTCMP4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSLBASED</name>
                  <description>Receive SUP based irrespective of BOI and fetch SUPLEN from DSL setting</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIXEDSLBASED</name>
                  <description>Receive SUP based irrespective of BOI and fetch SUPLEN from WCNTCMP4 setting</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STORESUP</name>
              <description>Store SUPP in BUFC</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SUPSHFFACTOR</name>
              <description>Supp Shift factor</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WCNTCMP4</name>
          <description>No Description</description>
          <addressOffset>0x0C8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>
          <fields>
            <field>
              <name>SUPPLENGTH</name>
              <description>Supp Length Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WCNTCMP5</name>
          <description>No Description</description>
          <addressOffset>0x0CC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>
          <fields>
            <field>
              <name>RXPAUSELOC</name>
              <description>RX pause location</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKTBUFCTRL</name>
          <description>No Description</description>
          <addressOffset>0x0D0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0303FFFF</resetMask>
          <fields>
            <field>
              <name>PKTBUFSTARTLOC</name>
              <description>Packet Buffer Start Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PKTBUFTHRESHOLD</name>
              <description>Packet Buffer Threshold</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PKTBUFTHRESHOLDEN</name>
              <description>Packet Buffer Threshold Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PKTBUFSTOP</name>
              <description>Packet Buffer stop receiving command</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKTBUFSTATUS</name>
          <description>No Description</description>
          <addressOffset>0x0D4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>
          <fields>
            <field>
              <name>PKTBUFCOUNT</name>
              <description>Packet Buffer Count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKTBUF0</name>
          <description>No Description</description>
          <addressOffset>0x0D8</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKTBUF0</name>
              <description>Packet Capture Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PKTBUF1</name>
              <description>Packet Capture Buffer</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PKTBUF2</name>
              <description>Packet Capture Buffer</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PKTBUF3</name>
              <description>Packet Capture Buffer</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKTBUF1</name>
          <description>No Description</description>
          <addressOffset>0x0DC</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKTBUF4</name>
              <description>Packet Capture Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PKTBUF5</name>
              <description>Packet Capture Buffer</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PKTBUF6</name>
              <description>Packet Capture Buffer</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PKTBUF7</name>
              <description>Packet Capture Buffer</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKTBUF2</name>
          <description>No Description</description>
          <addressOffset>0x0E0</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKTBUF8</name>
              <description>Packet Capture Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PKTBUF9</name>
              <description>Packet Capture Buffer</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PKTBUF10</name>
              <description>Packet Capture Buffer</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PKTBUF11</name>
              <description>Packet Capture Buffer</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKTBUF3</name>
          <description>No Description</description>
          <addressOffset>0x0E4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKTBUF12</name>
              <description>Packet Capture Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PKTBUF13</name>
              <description>Packet Capture Buffer</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PKTBUF14</name>
              <description>Packet Capture Buffer</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PKTBUF15</name>
              <description>Packet Capture Buffer</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKTBUF4</name>
          <description>No Description</description>
          <addressOffset>0x0E8</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKTBUF16</name>
              <description>Packet Capture Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PKTBUF17</name>
              <description>Packet Capture Buffer</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PKTBUF18</name>
              <description>Packet Capture Buffer</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PKTBUF19</name>
              <description>Packet Capture Buffer</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKTBUF5</name>
          <description>No Description</description>
          <addressOffset>0x0EC</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKTBUF20</name>
              <description>Packet Capture Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PKTBUF21</name>
              <description>Packet Capture Buffer</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PKTBUF22</name>
              <description>Packet Capture Buffer</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PKTBUF23</name>
              <description>Packet Capture Buffer</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKTBUF6</name>
          <description>No Description</description>
          <addressOffset>0x0F0</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKTBUF24</name>
              <description>Packet Capture Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PKTBUF25</name>
              <description>Packet Capture Buffer</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PKTBUF26</name>
              <description>Packet Capture Buffer</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PKTBUF27</name>
              <description>Packet Capture Buffer</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKTBUF7</name>
          <description>No Description</description>
          <addressOffset>0x0F4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKTBUF28</name>
              <description>Packet Capture Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PKTBUF29</name>
              <description>Packet Capture Buffer</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PKTBUF30</name>
              <description>Packet Capture Buffer</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PKTBUF31</name>
              <description>Packet Capture Buffer</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKTBUF8</name>
          <description>No Description</description>
          <addressOffset>0x0F8</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKTBUF32</name>
              <description>Packet Capture Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PKTBUF33</name>
              <description>Packet Capture Buffer</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PKTBUF34</name>
              <description>Packet Capture Buffer</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PKTBUF35</name>
              <description>Packet Capture Buffer</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKTBUF9</name>
          <description>No Description</description>
          <addressOffset>0x0FC</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKTBUF36</name>
              <description>Packet Capture Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PKTBUF37</name>
              <description>Packet Capture Buffer</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PKTBUF38</name>
              <description>Packet Capture Buffer</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PKTBUF39</name>
              <description>Packet Capture Buffer</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
