NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32MG24/EFR32MG24A020F1536IM40.svd
        <register>
          <name>LBTCTRL</name>
          <description>No Description</description>
          <addressOffset>0x054</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0F1F1FFF</resetMask>
          <fields>
            <field>
              <name>STARTEXP</name>
              <description>Start Exponent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXP0</name>
                  <description>STARTEXP value = 0 (used for Fast TX)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXP1</name>
                  <description>STARTEXP value = 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXP2</name>
                  <description>STARTEXP value = 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXP3</name>
                  <description>STARTEXP value = 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXP4</name>
                  <description>STARTEXP value = 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXP5</name>
                  <description>STARTEXP value = 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXP6</name>
                  <description>STARTEXP value = 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXP7</name>
                  <description>STARTEXP value = 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXP8</name>
                  <description>STARTEXP value = 8</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAXEXP</name>
              <description>Maximum Exponent</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXP0</name>
                  <description>MAXEXP value = 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXP1</name>
                  <description>MAXEXP value = 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXP2</name>
                  <description>MAXEXP value = 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXP3</name>
                  <description>MAXEXP value = 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXP4</name>
                  <description>MAXEXP value = 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXP5</name>
                  <description>MAXEXP value = 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXP6</name>
                  <description>MAXEXP value = 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXP7</name>
                  <description>MAXEXP value = 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXP8</name>
                  <description>MAXEXP value = 8</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCADELAY</name>
              <description>Clear Channel Assessment Delay</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCAREPEAT</name>
              <description>Clear Channel Assessment Repeat</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FIXEDBACKOFF</name>
              <description>Fixed backoff</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RETRYLIMIT</name>
              <description>Retry Limit</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LBTPRSCTRL</name>
          <description>No Description</description>
          <addressOffset>0x058</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x01010100</resetMask>
          <fields>
            <field>
              <name>LBTSTARTPRSEN</name>
              <description>Enable LBT start commands from PRS.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LBTPAUSEPRSEN</name>
              <description>Enable LBT pause commands from PRS.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LBTSTOPPRSEN</name>
              <description>Enable LBT stop commands from PRS.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LBTSTATE</name>
          <description>No Description</description>
          <addressOffset>0x05C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TOUT0PCNT</name>
              <description>TOUT0PCNT value to be saved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUT0CNT</name>
              <description>TOUT0CNT value to be saved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RANDOM</name>
          <description>No Description</description>
          <addressOffset>0x060</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>RANDOM</name>
              <description>Pseudo Random Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF</name>
          <description>No Description</description>
          <addressOffset>0x064</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FFFFFF7</resetMask>
          <fields>
            <field>
              <name>PRECNTOF</name>
              <description>PRECNT Overflow Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BASECNTOF</name>
              <description>BASECNT Overflow Interrupt Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRAPCNTOF</name>
              <description>WRAPCNT Overflow Interrupt Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUT0</name>
              <description>TOUT0 underflow interrupt flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUT1</name>
              <description>TOUT1 underflow interrupt flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUT0MATCH</name>
              <description>TOUT0 compare match interrupt flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUT1MATCH</name>
              <description>TOUT1 compare match interrupt flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CC0</name>
              <description>CC Channel 0 Interrupt Flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CC1</name>
              <description>CC Channel 1 Interrupt Flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CC2</name>
              <description>CC Channel 2 Interrupt Flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CC3</name>
              <description>CC Channel 3 Interrupt Flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CC4</name>
              <description>CC Channel 4 Interrupt Flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CC5</name>
              <description>CC Channel 5 Interrupt Flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CC6</name>
              <description>CC Channel 6 Interrupt Flag</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CC7</name>
              <description>CC Channel 7 Interrupt Flag</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COF0</name>
              <description>CC Channel 0 Overflow Interrupt Flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COF1</name>
              <description>CC Channel 1 Overflow Interrupt Flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COF2</name>
              <description>CC Channel 2 Overflow Interrupt Flag</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COF3</name>
              <description>CC Channel 3 Overflow Interrupt Flag</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COF4</name>
              <description>CC Channel 4 Overflow Interrupt Flag</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COF5</name>
              <description>CC Channel 5 Overflow Interrupt Flag</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COF6</name>
              <description>CC Channel 6 Overflow Interrupt Flag</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COF7</name>
              <description>CC Channel 7 Overflow Interrupt Flag</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LBTSUCCESS</name>
              <description>Listen Before Talk Success</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LBTFAILURE</name>
              <description>Listen Before Talk Failure</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LBTPAUSED</name>
              <description>Listen Before Talk Paused</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LBTRETRY</name>
              <description>Listen Before Talk Retry</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCCSYNCHED</name>
              <description>PROTIMER synchronized with the RTCC</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUT0MATCHLBT</name>
              <description>TOUT0 compare match interrupt flag</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
